/* Создаю таблицу */

create table query (
	searchid serial primary key,
	year int4 not Null,
	month int4 not Null,
	day int4 not Null,
	userid int4 not Null,
	ts bigint not Null,
	devicetype varchar(50) not Null,
	deviceid int4 not Null,
	query text not Null
);

/* Заношу в таблицу данные */

INSERT INTO query (year, month, day, userid, ts, devicetype, deviceid, query) VALUES
(2024, 11, 3, 101, 1730636276, 'desktop', 456, 'ноут'),
(2024, 11, 3, 101, 1730636284, 'desktop', 456, 'ноутбук'),
(2024, 11, 3, 101, 1730647384, 'desktop', 456, 'чай'),
(2024, 11, 3, 101, 1730647391, 'desktop', 456, 'чай черн'),
(2024, 11, 3, 101, 1730647402, 'desktop', 456, 'чай черный'),
(2024, 11, 3, 101, 1730647521, 'desktop', 456, 'кружка'),
(2024, 11, 5, 102, 1730837522, 'desktop', 5001, 'умн'),
(2024, 11, 5, 102, 1730837543, 'desktop', 5001, 'умные'),
(2024, 11, 5, 102, 1730837557, 'desktop', 5001, 'умные весы'),
(2024, 11, 5, 102, 1730837627, 'desktop', 5001, 'цв'),
(2024, 11, 5, 102, 1730837637, 'desktop', 5001, 'цветы'),
(2024, 10, 20, 105, 1729438950, 'mobile', 3007, 'куп'),
(2024, 10, 20, 105, 1729439010, 'mobile', 3007, 'купить'),
(2024, 10, 20, 105, 1729439035, 'mobile', 3007, 'купить телефон'),
(2024, 10, 21, 105, 1729504994, 'mobile', 3007, 'граф'),
(2024, 10, 21, 105, 1729505015, 'mobile', 3007, 'графич'),
(2024, 10, 21, 105, 1729505021, 'mobile', 3007, 'графический'),
(2024, 10, 21, 105, 1729505042, 'mobile', 3007, 'гравический планшет'),
(2024, 10, 21, 105, 1729515910, 'mobile', 3007, 'клав'),
(2024, 10, 21, 105, 1729515921, 'mobile', 3007, 'клавиатура');

